Masmiseim36/nxpSDK/boards/twrkv46f150m/bootloader_examples/tower_bootloader/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTC7 (number 79), J4[1]/J500[B62]/GC7/SW1
  @{ */
#define BOOT_PIN_SW1_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOOT_PIN_SW1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOOT_PIN_SW1_PIN 7U     /*!<@brief PORTC pin index: 7 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBootPin(void);

/*! @name PORTD6 (number 99), J500[A41]/J506[2]/GPIOD6/RXD0
  @{ */
#define UART0_POLLFORACTIVITY_RX_GPIO_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define UART0_POLLFORACTIVITY_RX_GPIO_PORT PORTD /*!<@brief PORT device name: PORTD */
#define UART0_POLLFORACTIVITY_RX_GPIO_PIN 6U     /*!<@brief PORTD pin index: 6 */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_PollForActivity(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 receive data source select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTD6 (number 99), J500[A41]/J506[2]/GPIOD6/RXD0
  @{ */
#define UART0_RX_PORT PORTD /*!<@brief PORT device name: PORTD */
#define UART0_RX_PIN 6U     /*!<@brief PORTD pin index: 6 */
                            /* @} */

/*! @name PORTD7 (number 100), J500[A42]/J505[2]/GPIOD7/TXD0
  @{ */
#define UART0_TX_PORT PORTD /*!<@brief PORT device name: PORTD */
#define UART0_TX_PIN 7U     /*!<@brief PORTD pin index: 7 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_InitPins(void);

#define ADCOPT_ADCACH7SEL_CH_G 0x06u /*!<@brief ADCA MUX1 selection for ADCA channel 7: ADCA MUX1's channel g. */

/*! @name PORTD6 (number 99), J500[A41]/J506[2]/GPIOD6/RXD0
  @{ */
#define UART0_RESTOREDEFAULT_RX_PORT PORTD /*!<@brief PORT device name: PORTD */
#define UART0_RESTOREDEFAULT_RX_PIN 6U     /*!<@brief PORTD pin index: 6 */
                                           /* @} */

/*! @name PORTD7 (number 100), J500[A42]/J505[2]/GPIOD7/TXD0
  @{ */
#define UART0_RESTOREDEFAULT_TX_PORT PORTD /*!<@brief PORT device name: PORTD */
#define UART0_RESTOREDEFAULT_TX_PIN 7U     /*!<@brief PORTD pin index: 7 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_RestoreDefault(void);

/*! @name PORTB0 (number 53), J500[B28]/J501[22]/GPIOB0/ADCB_CH2
  @{ */
#define I2C0_SCL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_SCL_PIN 0U     /*!<@brief PORTB pin index: 0 */
                            /* @} */

/*! @name PORTB1 (number 54), J500[B27]/J501[33]/GPIOB1/ADCB_CH3
  @{ */
#define I2C0_SDA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_SDA_PIN 1U     /*!<@brief PORTB pin index: 1 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C0_InitPins(void);

/*! @name PORTB0 (number 53), J500[B28]/J501[22]/GPIOB0/ADCB_CH2
  @{ */
#define I2C0_RESTOREDEFAULT_SCL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_RESTOREDEFAULT_SCL_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                           /* @} */

/*! @name PORTB1 (number 54), J500[B27]/J501[33]/GPIOB1/ADCB_CH3
  @{ */
#define I2C0_RESTOREDEFAULT_SDA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_RESTOREDEFAULT_SDA_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C0_RestoreDefault(void);

/*! @name PORTE16 (number 10), J500[A27]/J501[10]/GPIOE16/ADCA_CH0
  @{ */
#define SPI0_PCS_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_PCS_PIN 16U    /*!<@brief PORTE pin index: 16 */
                            /* @} */

/*! @name PORTE17 (number 11), J500[A28]/J501[12]/GPIOE17/ADCA_CH1
  @{ */
#define SPI0_SCK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_SCK_PIN 17U    /*!<@brief PORTE pin index: 17 */
                            /* @} */

/*! @name PORTE18 (number 12), J500[B30]/J501[18]/ADCB_CH0
  @{ */
#define SPI0_SOUT_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_SOUT_PIN 18U    /*!<@brief PORTE pin index: 18 */
                             /* @} */

/*! @name PORTE19 (number 13), J500[B29]/J501[20]/ADCB_CH1
  @{ */
#define SPI0_SIN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_SIN_PIN 19U    /*!<@brief PORTE pin index: 19 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI0_InitPins(void);

/*! @name PORTE16 (number 10), J500[A27]/J501[10]/GPIOE16/ADCA_CH0
  @{ */
#define SPI0_RESTOREDEFAULT_PCS_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_PCS_PIN 16U    /*!<@brief PORTE pin index: 16 */
                                           /* @} */

/*! @name PORTE17 (number 11), J500[A28]/J501[12]/GPIOE17/ADCA_CH1
  @{ */
#define SPI0_RESTOREDEFAULT_SCK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_SCK_PIN 17U    /*!<@brief PORTE pin index: 17 */
                                           /* @} */

/*! @name PORTE18 (number 12), J500[B30]/J501[18]/ADCB_CH0
  @{ */
#define SPI0_RESTOREDEFAULT_SOUT_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_SOUT_PIN 18U    /*!<@brief PORTE pin index: 18 */
                                            /* @} */

/*! @name PORTE19 (number 13), J500[B29]/J501[20]/ADCB_CH1
  @{ */
#define SPI0_RESTOREDEFAULT_SIN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_SIN_PIN 19U    /*!<@brief PORTE pin index: 19 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI0_RestoreDefault(void);

/*! @name PORTA13 (number 43), U503[4]/J16[3]/J500[B41]/J502[17]/GPIOA12/CAN0_RX
  @{ */
#define CAN0_RX_PORT PORTA /*!<@brief PORT device name: PORTA */
#define CAN0_RX_PIN 13U    /*!<@brief PORTA pin index: 13 */
                           /* @} */

/*! @name PORTA12 (number 42), U503[1]/J16[1]/J500[B42]/J502[15]/GPIOA12/CAN0_TX
  @{ */
#define CAN0_TX_PORT PORTA /*!<@brief PORT device name: PORTA */
#define CAN0_TX_PIN 12U    /*!<@brief PORTA pin index: 12 */
                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void CAN0_InitPins(void);

/*! @name PORTA13 (number 43), U503[4]/J16[3]/J500[B41]/J502[17]/GPIOA12/CAN0_RX
  @{ */
#define CAN0_RESTOREDEFAULT_RX_PORT PORTA /*!<@brief PORT device name: PORTA */
#define CAN0_RESTOREDEFAULT_RX_PIN 13U    /*!<@brief PORTA pin index: 13 */
                                          /* @} */

/*! @name PORTA12 (number 42), U503[1]/J16[1]/J500[B42]/J502[15]/GPIOA12/CAN0_TX
  @{ */
#define CAN0_RESTOREDEFAULT_TX_PORT PORTA /*!<@brief PORT device name: PORTA */
#define CAN0_RESTOREDEFAULT_TX_PIN 12U    /*!<@brief PORTA pin index: 12 */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void CAN0_RestoreDefault(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
